app/controllers/albums_controller.rb

  def show
    @album = params[:id]
    @photos = Photo.where("album='#{params[:id]}'")
---
SELECT "photos".* FROM "photos" WHERE (album='1')