app/controllers/blogs_controller.rb

  def show
    @blog = Blog.find(params[:id])
    @blogs= Blog.limit(5)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" LIMIT $1  [["LIMIT", 5]]