app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "nhan"], ["password_digest", "$2a$10$WqMkxTTzKlzFK0.RgGN7wuEamPNrQl6XENwuUwsC4.RYMnylxvMDm"], ["created_at", "2017-10-09 13:30:31.667082"], ["updated_at", "2017-10-09 13:30:31.667082"]]
---
    def create
        @user = User.new user_params
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @user = User.find_by id: params[:id]